Repository: pypi-data/pypi-mirror-379
Catalog: packages/collective.eeafaceted.batchactions/collective.eeafaceted.batchactions-1.16.5.tar.gz/collective.eeafaceted.batchactions-1.16.5/src/collective/eeafaceted/batchactions/locales/*/LC_MESSAGES/collective.eeafaceted.batchactions.po
Languages: fr

source: Add items
fr: Ajouter des éléments

source: Added values
fr: Éléments à ajouter / fixés

source: Apply
fr: Appliquer

source: Batch action choice
fr: Choix de l'action à effectuer

source: Batch contact field change
fr: Changement de contact par lot

source: Batch labels change
fr: Changer les étiquettes par lot

source: Batch state change
fr: Changer l'état par lot

source: Comment
fr: Commentaire

source: Delete elements
fr: Supprimer les éléments par lot

source: No common or available transition. Modify your selection.
fr: <span style='color: red;'>Aucune transition commune ou valide. Recommencez en modifiant votre sélection.</span>

source: Optional comment to display in history
fr: Commentaire optionnel qui sera affiché dans l'historique.

source: Overwrite
fr: Écraser le contenu avec les éléments choisis

source: Remove items
fr: Retirer des éléments

source: Removed values
fr: Éléments à retirer

source: Replace some items by others
fr: Remplacer des éléments par d'autres

source: Search and select the values to add.
fr: Chercher et sélectionner des contacts à ajouter.

source: Search and select the values to remove, if necessary.
fr: Chercher et sélectionner des contacts à retirer, si nécessaire.

source: Select the values to add.
fr: Sélectionner les éléments à ajouter.

source: Select the values to add. A personal label is represented by (*).
fr: Sélectionner les éléments à ajouter. Une étiquette utilisateur est indiquée par (*).

source: Select the values to remove.
fr: Sélectionner les éléments à retirer.

source: Select the values to remove. A personal label is represented by (*).
fr: Sélectionner les éléments à retirer. Une étiquette utilisateur est indiquée par (*).

source: This action will affect ${number} element(s).
fr: Cette action concerne <b>${number} élément(s)</b>.

source: This action will only affect ${deletable_number} element(s), indeed you do not have the permission to delete ${not_deletable_number} element(s).
fr: Cette action ne sera appliquée que sur <b>${deletable_number} élément(s) sélectionné(s)</b> car <span style='color: red;'>vous n'avez pas la permission de supprimer les autres ${not_deletable_number} élément(s).</span>

source: Update WF role mappings
fr: Mettre à jour les rôles/permissions (WF)

source: You can't change this field on selected items. Modify your selection.
fr: <span style='color: red;'>Vous ne pouvez pas modifier de manière commune ce champ sur les éléments sélectionnés. Modifiez votre sélection.</span>

source: aruo_action_replace_warning
fr: <p class='discreet'><strong>Attention</strong>, lors de l'utilisation de l'action "Remplacer des éléments par d'autres", l'action ne sera appliquée que si les "Éléments à retirer" sont tous présents à l'origine.</p>

source: delete-batch-action-but
fr: Supprimer

source: field_can_not_be_empty_warning
fr: <p class='discreet'><strong>Attention</strong>, le champ est requis et une action qui enleverait la dernière valeur sélectionnée ne sera pas appliquée.</p>

source: labels-batch-action-but
fr: Changer les étiquettes

source: transition-batch-action-but
fr: Changer l'état

source: update-wf-role-mappings-batch-action-but
fr: Mettre à jour les rôles/permissions (WF)
